### URL for problems: https://www.w3resource.com/python-exercises/pandas/index-data-series.php

In [2]:
import pandas as pd
import numpy as np

##### 25. Write a Pandas program to calculate the number of characters in each word in a given series.

In [12]:
s1 = pd.Series(['python', 'php', 'ruby', 'c#', 'fortran', 'html'])
s2 = s1.map(lambda x: len(x))
df = pd.DataFrame([s1, s2]).T.rename({0: 'word', 1: 'len(word)'}, axis=1)
df

      word len(word)
0   python         6
1      php         3
2     ruby         4
3       c#         2
4  fortran         7
5     html         4

##### 26. Write a Pandas program to compute difference of differences between consecutive numbers of a given series.

In [27]:
s1 = pd.Series([1, 3, 5, 6, 8, 9, 13, 15, 24])
s2 = pd.Series(s1.diff().diff().tolist())
s2

0    NaN
1    NaN
2    0.0
3   -1.0
4    1.0
5   -1.0
6    3.0
7   -2.0
8    7.0
dtype: float64

##### 27. Write a Pandas program to convert a series of date strings to a timeseries.

In [31]:
dates = ['01 Jan 2015', '10-02-2016', '20180307', '2014/05/06', '2016-04-12', '2019-04-06T11:20']
s1 = pd.to_datetime(pd.Series(dates))
s1

0   2015-01-01 00:00:00
1   2016-10-02 00:00:00
2   2018-03-07 00:00:00
3   2014-05-06 00:00:00
4   2016-04-12 00:00:00
5   2019-04-06 11:20:00
dtype: datetime64[ns]

##### 28. Write a Pandas program to get the day of month, day of year, week number and day of week from a given series of date strings.

In [45]:
dates = ['01 Jan 2015', '10-02-2016', '20180307', '2014/05/06', '2016-04-12', '2019-04-06T11:20']
s1 = pd.to_datetime(pd.Series(dates))
day = s1.dt.day.tolist()
day_of_year = s1.dt.day_of_year.tolist()
week_num = s1.dt.isocalendar().week.tolist()
day_name = s1.dt.day_name().tolist()
print(f'{day}\n{day_of_year}\n{week_num}\n{day_name}')

[1, 2, 7, 6, 12, 6]
[1, 276, 66, 126, 103, 96]
[1, 39, 10, 19, 15, 14]
['Thursday', 'Sunday', 'Wednesday', 'Tuesday', 'Tuesday', 'Saturday']

##### 29. Write a Pandas program to convert year-month string to dates adding a specified day of the month.

In [51]:
year_month = ['January 2015', 'February 2016', 'March 2017', 'April 2018', 'May 2019', 'June 2020', 'July 2021', 'August 2022']
s1 = pd.Series(year_month).map(lambda x: f'25 {x}')
s2 = pd.to_datetime(s1)
s2

0   2015-01-25
1   2016-02-25
2   2017-03-25
3   2018-04-25
4   2019-05-25
5   2020-06-25
6   2021-07-25
7   2022-08-25
dtype: datetime64[ns]

##### 33. Write a Pandas program to replace missing white spaces in a given string with the least frequent character.

In [91]:
word = list('abc def abcdef icd')
s1 = pd.Series(word)
curr_freq = s1.value_counts().index[-1]
new_str = "".join(s1.replace(' ', curr_freq))
new_str

'abcidefiabcdefiicd'

##### 35. Write a Pandas program to create a TimeSeries to display all the Sundays of given year.

In [105]:
s1 = pd.Series(pd.date_range(start='2022', end='2023', freq='W-SUN', inclusive='left'))
s1

0    2022-01-02
1    2022-01-09
2    2022-01-16
3    2022-01-23
4    2022-01-30
5    2022-02-06
6    2022-02-13
7    2022-02-20
8    2022-02-27
9    2022-03-06
10   2022-03-13
11   2022-03-20
12   2022-03-27
13   2022-04-03
14   2022-04-10
15   2022-04-17
16   2022-04-24
17   2022-05-01
18   2022-05-08
19   2022-05-15
20   2022-05-22
21   2022-05-29
22   2022-06-05
23   2022-06-12
24   2022-06-19
25   2022-06-26
26   2022-07-03
27   2022-07-10
28   2022-07-17
29   2022-07-24
30   2022-07-31
31   2022-08-07
32   2022-08-14
33   2022-08-21
34   2022-08-28
35   2022-09-04
36   2022-09-11
37   2022-09-18
38   2022-09-25
39   2022-10-02
40   2022-10-09
41   2022-10-16
42   2022-10-23
43   2022-10-30
44   2022-11-06
45   2022-11-13
46   2022-11-20
47   2022-11-27
48   2022-12-04
49   2022-12-11
50   2022-12-18
51   2022-12-25
dtype: datetime64[ns]

##### 36. Write a Pandas program to convert given series into a dataframe with its index as another column on the dataframe.

In [114]:
sr1 = ['a', 'b', 'c', 'd', 'e']
s1 = pd.Series(sr1, index=[1, 2, 3, 4, 5]).reset_index()
s1

   index  0
0      1  a
1      2  b
2      3  c
3      4  d
4      5  e

### Pandas DataFrame exersizes = https://www.w3resource.com/python-exercises/pandas/index-dataframe.php

##### 2. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

In [130]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data=exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

##### 3. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.

In [132]:
# using the previous problem dataframe:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

##### 4. Write a Pandas program to get the first 3 rows of a given DataFrame.

In [133]:
# using the previous problem dataframe:
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [136]:
df.iloc[:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

##### 5. Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

In [138]:
df[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

##### 6. Write a Pandas program to select the specified columns and rows from a given data frame.

In [141]:
df[['name', 'score']].iloc[[1, 3, 5, 6]]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5